app/controllers/microposts_controller.rb

SELECT * FROM `microposts`
---
  def index
    @microposts = Micropost.all

INSERT INTO `microposts` (`created_at`, `updated_at`, `user_id`, `content`) VALUES('2010-07-21 22:30:23', '2010-07-21 22:30:23', NULL, '')
---
  def create
    @micropost = Micropost.new(params[:micropost])
    if @micropost.save

SELECT * FROM `microposts` WHERE (`microposts`.`id` = 1)
---
  def find_micropost
    @micropost = Micropost.find(params[:id])

SELECT * FROM `users`
---
  def find_users
    @users = User.all