app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `created_at`, `updated_at`, `email`) VALUES('enrique', '2010-07-21 19:52:44', '2010-07-21 19:52:44', 'urzuae@gmail.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE `users` SET `updated_at` = '2010-07-22 00:27:02', `name` = 'urzua' WHERE `id` = 1
---
  def update
    if @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def find_user
    @user = User.find(params[:id])